app/controllers/api/bookings_controller.rb

    def create
        @booking = Booking.new(booking_params)
        if @booking.save
---
INSERT INTO "bookings" ("user_id", "surfspot_id", "check_in", "check_out", "num_guest", "host_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"