app/controllers/api/reviews_controller.rb

INSERT INTO "reviews" ("author_id", "surfspot_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 141], ["surfspot_id", 73], ["body", "sdfgsdfgsg"], ["created_at", "2019-08-23 01:25:45.839021"], ["updated_at", "2019-08-23 01:25:45.839021"]]
---
    def create

        @review = Review.new(review_params)

        if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 55]]
---
    def destroy
        @review = Review.find(params[:id])
        if @review.destroy

SELECT "reviews".* FROM "reviews" WHERE "reviews"."surfspot_id" = $1  [["surfspot_id", 59]]
SELECT  "surfspots".* FROM "surfspots" WHERE "surfspots"."id" = $1 LIMIT $2  [["id", 72], ["LIMIT", 1]]
---
    def index
        @reviews = Surfspot.find(params[:surfspot_id]).reviews