app/controllers/api/surfspots_controller.rb

    def index
        if params["hostId"]
            @surfspots = Surfspot.where(host_id: params["hostId"])
        else
            # byebug
            searchParams = params["searchParams"].split("?query=").join("").downcase
            if !searchParams.empty?
                @surfspots = Surfspot.search(searchParams)
---
SELECT "surfspots".* FROM "surfspots"

    def destroy
        @surfspot = Surfspot.find(params[:id])
---
SELECT  "surfspots".* FROM "surfspots" WHERE "surfspots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def show
        @surfspot = Surfspot.find(params[:id])
---
SELECT  "surfspots".* FROM "surfspots" WHERE "surfspots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]