app/views/api/surfspots/_surfspot.json.jbuilder


json.photos surfspot.photos.pluck(:img_url)
---
SELECT "photos"."img_url" FROM "photos" WHERE "photos"."surfspot_id" = $1  [["surfspot_id", "17"]]