app/views/api/surfspots/_surfspots_show.json.jbuilder

SELECT "photos"."img_url" FROM "photos" WHERE "photos"."surfspot_id" = $1  [["surfspot_id", "16"]]
---

json.photos surfspot.photos.pluck(:img_url)