app/views/api/reviews/_review.json.jbuilder

json.surfspot_title surfspot.title
json.surfspot_photos surfspot.photos.pluck(:img_url)
---
SELECT "photos"."img_url" FROM "photos" WHERE "photos"."surfspot_id" = $1  [["surfspot_id", "71"]]